Revit 2027 API
Curve.ApproximateLength Property
The approximate length of the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ApproximateLength { get; }
Public ReadOnly Property ApproximateLength As Double
	Get
public:
property double ApproximateLength {
	double get ();
}
member ApproximateLength : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the curve is unbound and not periodic.
Remarks
Quickly estimates the length of the curve, may deviate by a factor of 2 in some cases. The computation is exact for lines and arcs.
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace